{
    "https://graduateland.com/job/51447115/13": {
        "title": "Student assistant for supporting leaders in their daily tasks at Ørsted",
        "job_desc": "\nImagine a future where you use your ability to keep an overview and your coordination skills to support leaders in their daily responsibilities.Join us in this role where you’ll be responsible for administrative tasks related to our Danish leaders’ work. You’ll have onboarding tasks, such as ordering equipment, ID cards, and gifts and you’ll ensure that all pre-onboarding related tasks are done before hiring date. You’ll also be responsible for having an overview of all external consultants and, e.g., their extensions and termination. You’ll furthermore be supporting leaders in conducting yearly recurring people leadership activities.Welcome to ITYou’ll be part of People Leadership Centre of Excellence (CoE) within IT where you, together with your colleagues, will build and maintain a strong people leadership capability for the IT organisation in our company. In the IT organisation, we work full blown agile and work according to the Scaled Agile Framework. We believe in joint successes and the opportunity to explore, develop, and have fun while working. You’ll be part of a CoE with five friendly and passionate colleagues where you’ll be supporting a group of approx. 14 Danish leaders.You’ll play an important role in:assisting in administrative tasks within the People Leadership CoEfollowing up on extensions, termination, time-registration, and mandatory training for external consultants and escalate if an external is not adhering to rulesparticipating in solving tasks regarding the people leadership backlogfunctioning as contactor support person for all people leaders on people leadership in generalordering ID-cards, equipment, and flowers for all internal and external newcomersbooking placeholders in our leader’s calendars for known annual wheel activities.To succeed in the role, you:are able to keep an overview and have good coordination skillsthrive in doing administrative taskspreferably have 3-5 years left before graduating with a master’s degreeare a strong team player with the ability to interact in a larger group with many different tasksare able to keep things simple and separated, as there are many leaders, consultants, and different tasksare slightly familiar with the agile mindset and behaviours.Join a global leader in renewable energyØrsted is a growing green energy major and global leader in climate action. With us you’ll play a part in driving change towards a green energy future. You’ll grow your talent in a fast-paced and high-growth industry where you have plenty of opportunities to learn and develop through challenging assignments and industry-leading experts. Here, you can perform in a friendly work environment based on trust, respect, and collaboration.Shape the future with usSend your application to us no later than 11 December 2022. We’ll be conducting interviews on a continuous basis and reserve the right to take down the advert when we have found the right candidate. Please don’t hesitate to contact Benedikte Eg Moelhave-Kragekjaer, People Leadership Consultant, on (Denmark +45) 99556159 on Tuesdays and Thursdays from 09:00-12:00 CET; Central European Time if you’d like to know more about the position. If you need to request any adjustments to working practices, working patterns, or the assessment or interview process we're happy to discuss alternative arrangements. Please note that for your application to be taken into consideration, you must submit your application via our online career pages and answer the screening questions relevant for your country.\n",
        "company": "Ørsted",
        "industry": "Multiple industries",
        "followers": "4062",
        "logo": "https://d1k976m6pd0u9m.cloudfront.net/public/employer/logo/g43ql0iq55__rsted.png.webp",
        "location": "Gentofte, Denmark",
        "category": "Administration",
        "job_type": "Part-time",
        "skills": [
            "Team Player",
            " Structured",
            " Coordination"
        ],
        "language": "English, Professional"
    }
}